### Pandas 排序

In [1]:
import pandas as pd
import numpy as np
client_dictionary = {'name': ['Michael', 'Ana', 'Sean'], 
                     'country': ['UK', 'UK', 'USA'], 
                     'age': [10, 51, 13],
                     'latest date active': ['07-05-2019', '23-12-2019', '03-04-2016']}
df = pd.DataFrame(client_dictionary)
df.head()

      name country  age latest date active
0  Michael      UK   10         07-05-2019
1      Ana      UK   51         23-12-2019
2     Sean     USA   13         03-04-2016

In [4]:
df.sort_values(by='name')

      name country  age latest date active
1      Ana      UK   51         23-12-2019
0  Michael      UK   10         07-05-2019
2     Sean     USA   13         03-04-2016

In [5]:
df.sort_values(by='name', ascending=False)

      name country  age latest date active
2     Sean     USA   13         03-04-2016
0  Michael      UK   10         07-05-2019
1      Ana      UK   51         23-12-2019

In [6]:
df.sort_values(by='age')

      name country  age latest date active
0  Michael      UK   10         07-05-2019
2     Sean     USA   13         03-04-2016
1      Ana      UK   51         23-12-2019

In [7]:
df['latest date active'] = df['latest date active'].astype('datetime64[ns]')
df.sort_values(by='latest date active')

      name country  age latest date active
2     Sean     USA   13         2016-03-04
0  Michael      UK   10         2019-07-05
1      Ana      UK   51         2019-12-23

In [9]:
df.sort_values(by=['country','name'])

      name country  age latest date active
1      Ana      UK   51         2019-12-23
0  Michael      UK   10         2019-07-05
2     Sean     USA   13         2016-03-04

In [10]:
df.sort_values(by=['country','name'], inplace=True)

In [11]:
df

      name country  age latest date active
1      Ana      UK   51         2019-12-23
0  Michael      UK   10         2019-07-05
2     Sean     USA   13         2016-03-04